Meltfxn

In [13]:
# this fxns are used to reshape the panda file

import pandas as pd 

var = pd.DataFrame({"day":["day1","day2","day3","day4","day5","day6"],"eng_num":[10,12,11,14,11,10],"math_num":[100,32,41,14,11,60]})

var

    day  eng_num  math_num
0  day1       10       100
1  day2       12        32
2  day3       11        41
3  day4       14        14
4  day5       11        11
5  day6       10        60

In [3]:
# we want the table vertically or reshaped vertically : use melt fxn

pd.melt(var)

# if we want to make a specif data as id :  use 'id_vars' parameter

pd.melt(var,id_vars=["day"]) # here data of day is working as a id.

# we can customize name : use var_name parameter

pd.melt(var,id_vars=["day"],var_name="python")

     day    python  value
0   day1   eng_num     10
1   day2   eng_num     12
2   day3   eng_num     11
3   day4   eng_num     14
4   day5   eng_num     11
5   day6   eng_num     10
6   day1  math_num    100
7   day2  math_num     32
8   day3  math_num     41
9   day4  math_num     14
10  day5  math_num     11
11  day6  math_num     60

pivot fxn

In [10]:
# The pivot function in Pandas is a method used to reshape data by transforming rows into columns. The Pandas pivot function comes into play when there's a need to rearrange data from a “long” format to a “wide” format.

var_2 = pd.DataFrame({"day":["day1","day2","day3","day4","day5","day6"],"St_name":["Ayush","dara","sara","Ayush","dara","sara"],"eng_num":[10,12,11,14,11,10],"math_num":[100,32,41,14,11,60]})

var_2

# set acoording to the student name : use pivot fxn 

var_2.pivot(index="day",columns="St_name")

        eng_num             math_num
St_name   Ayush  dara  sara    Ayush  dara  sara
day
day1       10.0   NaN   NaN    100.0   NaN   NaN
day2        NaN  12.0   NaN      NaN  32.0   NaN
day3        NaN   NaN  11.0      NaN   NaN  41.0
day4       14.0   NaN   NaN     14.0   NaN   NaN
day5        NaN  11.0   NaN      NaN  11.0   NaN
day6        NaN   NaN  10.0      NaN   NaN  60.0

In [5]:
# if we want a single data : use 'value' keyword

var_2.pivot(index="day",columns="St_name",values="eng_num")

St_name  Ayush  dara  sara
day
day1      10.0   NaN   NaN
day2       NaN  12.0   NaN
day3       NaN   NaN  11.0
day4      14.0   NaN   NaN
day5       NaN  11.0   NaN
day6       NaN   NaN  10.0

In [ ]:
var_3 = pd.DataFrame({"day":["day1","day1","day1","day1","day2","day2"],"eng_num":[10,12,11,14,11,10],"math_num":[100,32,41,14,11,60]})

var_3

// if we want sum , mean, etc
//  var_3.pivot_table(index = "st_name", columns = "day", aggfuncf = "mean")

margin

    day  eng_num  math_num
0  day1       10       100
1  day1       12        32
2  day1       11        41
3  day1       14        14
4  day2       11        11
5  day2       10        60